/*
    Function
    특정한 일을 수행하는 코드의 집합
    필요한 데이터를 입력[Input]받아서 내부 일을 수행한 다음 결과값을 출력(리턴)[Output] 하게 된다.

    function[함수정의 키워드] add[함수이름](a,b)[매개변수,인자 parameter] {
        return a+b; [결과값 반환]
    }
    add(1,2); 매개변수로 (parameter,인자)로 1,2를 전달하여 함수를 호출 


    ★ 함수단위로 작은 단위의 일들을 묶어야 한다.
    ★ 수행하는 일을 잘 나타낼 수 있는 이름을 지어야 한다.
    ★ 매개변수의 이름도 의미있게 지어야 한다. 

    함수도 데이터타입으로 치면 객체 이기 때문에 함수를 정의하면 함수의 object가 Hip 이라는 메모리 공간에 할당된다. 
    함수의 이름 = 함수 object가 담겨있는 메모리 주소를 가르키고 (가지고) 있다. 
    ★ 함수의 이름은 함수를 참조하고 있다. 

    
*/